balazsgrill/modembed/pic/core/hu.modembed.pic.ui/device-descriptors/18xxxx/PIC18F86J93.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA19" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA19" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDDATA19" edc:desc="" edc:mask="0xff" edc:name="LCDDATA19" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="S8C3" edc:desc="" edc:mask="0x1" edc:name="S8C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S9C3" edc:desc="" edc:mask="0x1" edc:name="S9C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S10C3" edc:desc="" edc:mask="0x1" edc:name="S10C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S11C3" edc:desc="" edc:mask="0x1" edc:name="S11C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S12C3" edc:desc="" edc:mask="0x1" edc:name="S12C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S13C3" edc:desc="" edc:mask="0x1" edc:name="S13C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S14C3" edc:desc="" edc:mask="0x1" edc:name="S14C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S15C3" edc:desc="" edc:mask="0x1" edc:name="S15C3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEG8COM3" edc:desc="" edc:mask="0x1" edc:name="SEG8COM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG9COM3" edc:desc="" edc:mask="0x1" edc:name="SEG9COM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG10COM3" edc:desc="" edc:mask="0x1" edc:name="SEG10COM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG11COM3" edc:desc="" edc:mask="0x1" edc:name="SEG11COM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG12COM3" edc:desc="" edc:mask="0x1" edc:name="SEG12COM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG13COM3" edc:desc="" edc:mask="0x1" edc:name="SEG13COM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG14COM3" edc:desc="" edc:mask="0x1" edc:name="SEG14COM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG15COM3" edc:desc="" edc:mask="0x1" edc:name="SEG15COM3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="S08C3" edc:desc="" edc:mask="0x1" edc:name="S08C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S09C3" edc:desc="" edc:mask="0x1" edc:name="S09C3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA20" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA20" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDDATA20" edc:desc="" edc:mask="0xff" edc:name="LCDDATA20" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="S16C3" edc:desc="" edc:mask="0x1" edc:name="S16C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S17C3" edc:desc="" edc:mask="0x1" edc:name="S17C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S18C3" edc:desc="" edc:mask="0x1" edc:name="S18C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S19C3" edc:desc="" edc:mask="0x1" edc:name="S19C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S20C3" edc:desc="" edc:mask="0x1" edc:name="S20C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S21C3" edc:desc="" edc:mask="0x1" edc:name="S21C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S22C3" edc:desc="" edc:mask="0x1" edc:name="S22C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S23C3" edc:desc="" edc:mask="0x1" edc:name="S23C3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEG16COM3" edc:desc="" edc:mask="0x1" edc:name="SEG16COM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG17COM3" edc:desc="" edc:mask="0x1" edc:name="SEG17COM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG18COM3" edc:desc="" edc:mask="0x1" edc:name="SEG18COM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG19COM3" edc:desc="" edc:mask="0x1" edc:name="SEG19COM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG20COM3" edc:desc="" edc:mask="0x1" edc:name="SEG20COM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG21COM3" edc:desc="" edc:mask="0x1" edc:name="SEG21COM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG22COM3" edc:desc="" edc:mask="0x1" edc:name="SEG22COM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG23COM3" edc:desc="" edc:mask="0x1" edc:name="SEG23COM3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA21" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA21" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDDATA21" edc:desc="" edc:mask="0xff" edc:name="LCDDATA21" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="S24C3" edc:desc="" edc:mask="0x1" edc:name="S24C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S25C3" edc:desc="" edc:mask="0x1" edc:name="S25C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S26C3" edc:desc="" edc:mask="0x1" edc:name="S26C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S27C3" edc:desc="" edc:mask="0x1" edc:name="S27C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S28C3" edc:desc="" edc:mask="0x1" edc:name="S28C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S29C3" edc:desc="" edc:mask="0x1" edc:name="S29C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S30C3" edc:desc="" edc:mask="0x1" edc:name="S30C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S31C3" edc:desc="" edc:mask="0x1" edc:name="S31C3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEG24COM3" edc:desc="" edc:mask="0x1" edc:name="SEG24COM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG25COM3" edc:desc="" edc:mask="0x1" edc:name="SEG25COM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG26COM3" edc:desc="" edc:mask="0x1" edc:name="SEG26COM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG27COM3" edc:desc="" edc:mask="0x1" edc:name="SEG27COM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG28COM3" edc:desc="" edc:mask="0x1" edc:name="SEG28COM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG29COM3" edc:desc="" edc:mask="0x1" edc:name="SEG29COM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG30COM3" edc:desc="" edc:mask="0x1" edc:name="SEG30COM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG31COM3" edc:desc="" edc:mask="0x1" edc:name="SEG31COM3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
